
# 3. Программа принимает на вход число N и выводит числа от -N до N.
#    Примеры: 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5 
"""
a = int(input('Введите число N '))

for i in range(-a, a + 1):   
    print(i, end = ' ')
"""
#================================
"""
a = int(input('Введите число N ')) 
s = '' 
for i in range(-a, a + 1): 
    s = s + ' ' + str(i) 
#   print (s) 
print (s[1:]) 
"""
#================================

a = int(input ("Введите число "))

num_list = list(range(-a, a + 1))

print(num_list) 

#==========================