
# Функция zip()
# Применяется к набору итерируемых объектов и возвращает итератор с кортежами из элементов 
# входных данных.
# Количество элементов в результате равно минимальному количеству элементов входного набора.
# Нельзя пройтись дважды.

# zip ([1, 2, 3], ['o', 'д', 'т'], ['f', 's', 't'])
#     [(1, 'о', 'f'), (2, 'д', 's'), (3, 'т', 't)]

# users = ['user1', 'user2', 'user3', 'user4', 'user5']
# ids = [4, 5, 9, 14, 7]

# data = list(zip(users, ids)) # <zip object at 0x7fa0ebd5e300> => нужен тип - list, например
# print(data) # [('user1', 4), ('user2', 5), ('user3', 9), ('user4', 14), ('user5', 7)]

#==========================

# Добавляем исходный список.

users = ['user1', 'user2', 'user3', 'user4', 'user5']
ids = [4, 5, 9, 14, 7]
salary = [111, 222, 333]

data = list(zip(users, ids, salary)) # <zip object at 0x7fa0ebd5e300> => нужен тип - list, например
print(data) # [('user1', 4, 111), ('user2', 5, 222), ('user3', 9, 333)]