# !!! Ввод списка целиком через пробел.

entered_list = input("Введите список чисел, разделенных пробелом: ").split() 

print("Введенный список:", entered_list) 

#============================
# Повторный запрос на ввод заданное количество раз.

"""
for i in range(5): 
    i = int(input('Введите число: '))

num = i

if num > i: 
    i = num 

print(i) 
"""
#===========================
# Замена символа конца строки.
"""
a = int(input('Введите число N '))

for i in range(-a, a + 1):   
    print(i, end=' ')
    """
#===========================
